:PROPERTIES:
:ID:       78cdb3b0-9c99-49c3-b257-bf1a86c2041a
:END:
#+title: MushR: Mycodo TLS Certificate Setup

Notes and configuration for setting up Mycodo with Let's encrypt
certificates (Based on [[https://certbot.eff.org/instructions?ws=other&os=debianstretch&commit=%3E][the official certbot instructions]]).

* Install Dependencies

#+begin_src bash :dir /ssh:mushr-mycodo2|sudo:root@mushr-mycodo2:/home/test :results output :session
  apt install certbot -y
#+end_src
  

#+RESULTS:
#+begin_example
Reading package lists... 0%Reading package lists... 0%Reading package lists... 0%Reading package lists... 29%Reading package lists... 54%Reading package lists... 81%Reading package lists... 95%Reading package lists... 95%Reading package lists... 95%Reading package lists... 95%Reading package lists... 96%Reading package lists... 96%Reading package lists... 96%Reading package lists... 96%Reading package lists... 98%Reading package lists... 98%Reading package lists... Done
Building dependency tree... 0%Building dependency tree... 0%Building dependency tree... 0%Building dependency tree... 50%Building dependency tree... 50%Building dependency tree... Done
Reading state information... 0% Reading state information... 0%Reading state information... Done
The following package was automatically installed and is no longer required:
  libfuse2
Use 'sudo apt autoremove' to remove it.
The following additional packages will be installed:
  python3-acme python3-certbot python3-configargparse python3-configobj
  python3-icu python3-josepy python3-parsedatetime python3-requests-toolbelt
  python3-rfc3339 python3-tz python3-zope.component python3-zope.event
  python3-zope.hookable python3-zope.interface
Suggested packages:
  python3-certbot-apache python3-certbot-nginx python-certbot-doc
  python-acme-doc python-configobj-doc
The following NEW packages will be installed:
  certbot python3-acme python3-certbot python3-configargparse
  python3-configobj python3-icu python3-josepy python3-parsedatetime
  python3-requests-toolbelt python3-rfc3339 python3-tz python3-zope.component
  python3-zope.event python3-zope.hookable python3-zope.interface
0 upgraded, 15 newly installed, 0 to remove and 0 not upgraded.
Need to get 910 kB of archives.
After this operation, 4329 kB of additional disk space will be used.
[33m0% [Working][0m[33m0% [Working][0m            Get:1 http://ftp.gwdg.de/pub/linux/debian/raspbian/raspbian bullseye/main armhf python3-josepy all 1.2.0-2 [28.4 kB]
[33m0% [1 python3-josepy 0 B/28.4 kB 0%] [Waiting for headers][0m[33m                                                          4% [Waiting for headers][0m[33m                        4% [Working][0m            Get:2 http://ftp.gwdg.de/pub/linux/debian/raspbian/raspbian bullseye/main armhf python3-requests-toolbelt all 0.9.1-1 [41.7 kB]
[33m4% [2 python3-requests-toolbelt 0 B/41.7 kB 0%] [Connecting to raspbian.raspber[0m[33m                                                                               9% [Waiting for headers][0m[33m                        9% [Working][0m            Get:3 http://ftp.gwdg.de/pub/linux/debian/raspbian/raspbian bullseye/main armhf python3-tz all 2021.1-1 [34.8 kB]
[33m9% [3 python3-tz 1064 B/34.8 kB 3%] [Connecting to raspbian.raspberrypi.org (93[0m[33m                                                                               13% [Connecting to raspbian.raspberrypi.org (93.93.128.193)][0m[33m                                                            13% [Working][0m             Get:4 http://ftp.gwdg.de/pub/linux/debian/raspbian/raspbian bullseye/main armhf python3-rfc3339 all 1.1-2 [6768 B]
[33m13% [4 python3-rfc3339 0 B/6768 B 0%] [Waiting for headers][0m[33m                                                           15% [Waiting for headers][0m[33m                         15% [Working][0m             Get:5 http://ftp.gwdg.de/pub/linux/debian/raspbian/raspbian bullseye/main armhf python3-acme all 1.12.0-2 [34.6 kB]
[33m15% [5 python3-acme 1064 B/34.6 kB 3%] [Connecting to raspbian.raspberrypi.org [0m[33m                                                                               20% [Waiting for headers][0m[33m                         20% [Working][0m             Get:6 http://ftp.gwdg.de/pub/linux/debian/raspbian/raspbian bullseye/main armhf python3-configargparse all 1.2.3-1 [25.2 kB]
[33m20% [6 python3-configargparse 1064 B/25.2 kB 4%] [Connecting to raspbian.raspbe[0m[33m                                                                               23% [Waiting for headers][0m[33m                         23% [Working][0m             Get:7 http://ftp.gwdg.de/pub/linux/debian/raspbian/raspbian bullseye/main armhf python3-configobj all 5.0.6-4 [35.8 kB]
[33m23% [7 python3-configobj 1064 B/35.8 kB 3%] [Connecting to raspbian.raspberrypi[0m[33m                                                                               28% [Waiting for headers][0m[33m                         28% [Working][0m             Get:8 http://ftp.gwdg.de/pub/linux/debian/raspbian/raspbian bullseye/main armhf python3-parsedatetime all 2.6-1 [41.3 kB]
[33m28% [8 python3-parsedatetime 0 B/41.3 kB 0%] [Connecting to raspbian.raspberryp[0m[33m                                                                               33% [Waiting for headers][0m[33m                         33% [Working][0m             Get:9 http://raspbian.raspberrypi.org/raspbian bullseye/main armhf python3-zope.hookable armhf 5.0.1-1+b1 [12.5 kB]
[33m33% [9 python3-zope.hookable 1064 B/12.5 kB 9%] [Connecting to raspbian.raspber[0m[33m                                                                               35% [Waiting for headers][0m[33m                         35% [Working][0m             Get:10 http://ftp.gwdg.de/pub/linux/debian/raspbian/raspbian bullseye/main armhf python3-zope.interface armhf 5.2.0-1 [140 kB]
[33m35% [10 python3-zope.interface 1062 B/140 kB 1%] [Connecting to raspbian.raspbe[0m[33m                                                                               49% [Waiting for headers][0m[33m                         49% [Working][0m             Get:11 http://ftp.gwdg.de/pub/linux/debian/raspbian/raspbian bullseye/main armhf python3-zope.event all 4.4-3 [9420 B]
[33m49% [11 python3-zope.event 1065 B/9420 B 11%] [Connecting to raspbian.raspberry[0m[33m                                                                               51% [Connecting to raspbian.raspberrypi.org (93.93.128.193)][0m[33m                                                            51% [Working][0m             Get:12 http://ftp.gwdg.de/pub/linux/debian/raspbian/raspbian bullseye/main armhf python3-zope.component all 4.3.0-3 [43.1 kB]
[33m51% [12 python3-zope.component 1064 B/43.1 kB 2%] [Connecting to raspbian.raspb[0m[33m                                                                               56% [Connecting to raspbian.raspberrypi.org (93.93.128.193)][0m[33m                                                            56% [Working][0m             Get:13 http://ftp.gwdg.de/pub/linux/debian/raspbian/raspbian bullseye/main armhf python3-certbot all 1.12.0-2 [194 kB]
[33m56% [13 python3-certbot 1062 B/194 kB 1%] [Connecting to raspbian.raspberrypi.o[0m[33m                                                                               57% [13 python3-certbot 15.5 kB/194 kB 8%] [Waiting for headers][0m[33m                                                                59% [13 python3-certbot 35.8 kB/194 kB 18%][0m[33m                                           71% [13 python3-certbot 176 kB/194 kB 91%][0m[33m                                          74% [Working][0m             Get:14 http://ftp.gwdg.de/pub/linux/debian/raspbian/raspbian bullseye/main armhf certbot all 1.12.0-2 [49.7 kB]
[33m74% [14 certbot 1064 B/49.7 kB 2%][0m[33m                                  80% [Working][0m             Get:15 http://raspbian.raspberrypi.org/raspbian bullseye/main armhf python3-icu armhf 2.5-1+b1 [213 kB]
[33m80% [15 python3-icu 590 B/213 kB 0%][0m[33m87% [15 python3-icu 77.3 kB/213 kB 36%][0m[33m                                       91% [15 python3-icu 122 kB/213 kB 58%][0m[33m                                      100% [Working][0m              Fetched 910 kB in 6s (161 kB/s)
Preconfiguring packages ...
Selecting previously unselected package python3-josepy.
(Reading database ... (Reading database ... 5%(Reading database ... 10%(Reading database ... 15%(Reading database ... 20%(Reading database ... 25%(Reading database ... 30%(Reading database ... 35%(Reading database ... 40%(Reading database ... 45%(Reading database ... 50%(Reading database ... 55%(Reading database ... 60%(Reading database ... 65%(Reading database ... 70%(Reading database ... 75%(Reading database ... 80%(Reading database ... 85%(Reading database ... 90%(Reading database ... 95%(Reading database ... 100%(Reading database ... 106404 files and directories currently installed.)
Preparing to unpack .../00-python3-josepy_1.2.0-2_all.deb ...
Unpacking python3-josepy (1.2.0-2) ...
Selecting previously unselected package python3-requests-toolbelt.
Preparing to unpack .../01-python3-requests-toolbelt_0.9.1-1_all.deb ...
Unpacking python3-requests-toolbelt (0.9.1-1) ...
Selecting previously unselected package python3-tz.
Preparing to unpack .../02-python3-tz_2021.1-1_all.deb ...
Unpacking python3-tz (2021.1-1) ...
Selecting previously unselected package python3-rfc3339.
Preparing to unpack .../03-python3-rfc3339_1.1-2_all.deb ...
Unpacking python3-rfc3339 (1.1-2) ...
Selecting previously unselected package python3-acme.
Preparing to unpack .../04-python3-acme_1.12.0-2_all.deb ...
Unpacking python3-acme (1.12.0-2) ...
Selecting previously unselected package python3-configargparse.
Preparing to unpack .../05-python3-configargparse_1.2.3-1_all.deb ...
Unpacking python3-configargparse (1.2.3-1) ...
Selecting previously unselected package python3-configobj.
Preparing to unpack .../06-python3-configobj_5.0.6-4_all.deb ...
Unpacking python3-configobj (5.0.6-4) ...
Selecting previously unselected package python3-parsedatetime.
Preparing to unpack .../07-python3-parsedatetime_2.6-1_all.deb ...
Unpacking python3-parsedatetime (2.6-1) ...
Selecting previously unselected package python3-zope.hookable.
Preparing to unpack .../08-python3-zope.hookable_5.0.1-1+b1_armhf.deb ...
Unpacking python3-zope.hookable (5.0.1-1+b1) ...
Selecting previously unselected package python3-zope.interface.
Preparing to unpack .../09-python3-zope.interface_5.2.0-1_armhf.deb ...
Unpacking python3-zope.interface (5.2.0-1) ...
Selecting previously unselected package python3-zope.event.
Preparing to unpack .../10-python3-zope.event_4.4-3_all.deb ...
Unpacking python3-zope.event (4.4-3) ...
Selecting previously unselected package python3-zope.component.
Preparing to unpack .../11-python3-zope.component_4.3.0-3_all.deb ...
Unpacking python3-zope.component (4.3.0-3) ...
Selecting previously unselected package python3-certbot.
Preparing to unpack .../12-python3-certbot_1.12.0-2_all.deb ...
Unpacking python3-certbot (1.12.0-2) ...
Selecting previously unselected package certbot.
Preparing to unpack .../13-certbot_1.12.0-2_all.deb ...
Unpacking certbot (1.12.0-2) ...
Selecting previously unselected package python3-icu.
Preparing to unpack .../14-python3-icu_2.5-1+b1_armhf.deb ...
Unpacking python3-icu (2.5-1+b1) ...
Setting up python3-configargparse (1.2.3-1) ...
Setting up python3-requests-toolbelt (0.9.1-1) ...
Setting up python3-parsedatetime (2.6-1) ...
Setting up python3-icu (2.5-1+b1) ...
Setting up python3-zope.event (4.4-3) ...
Setting up python3-zope.interface (5.2.0-1) ...
Setting up python3-tz (2021.1-1) ...
Setting up python3-zope.hookable (5.0.1-1+b1) ...
Setting up python3-configobj (5.0.6-4) ...
Setting up python3-josepy (1.2.0-2) ...
Setting up python3-rfc3339 (1.1-2) ...
Setting up python3-zope.component (4.3.0-3) ...
Setting up python3-acme (1.12.0-2) ...
Setting up python3-certbot (1.12.0-2) ...
Setting up certbot (1.12.0-2) ...
Created symlink /etc/systemd/system/timers.target.wants/certbot.timer → /lib/systemd/system/certbot.timer.
Processing triggers for man-db (2.9.4-2) ...
#+end_example

* Stop Mycodo

#+begin_src bash :dir /ssh:mushr-mycodo2|sudo:root@mushr-mycodo2:/home/test :results output :session
  systemctl stop mycodo
  systemctl stop mycodoflask
  systemctl stop nginx
#+end_src

* Requesting Certificates

1. Run the following command (using =sudo=) and follow the instructions.

   #+begin_src bash :dir /ssh:mushr-mycodo2|sudo:root@mushr-mycodo2:/home/test :results output :session
     certbot certonly --standalone
   #+end_src

2. If this is successful, you can check the existance of these certificates:

   #+begin_src bash :dir /ssh:mushr-mycodo2|sudo:root@mushr-mycodo2:/etc/letsencrypt/ :results output :session
     ls /etc/letsencrypt/live/<domain-name>
   #+end_src

3. Test automatic renewal

   #+begin_src bash :dir /ssh:mushr-mycodo2|sudo:root@mushr-mycodo2:/etc/letsencrypt/ :results output :session
     certbot renew --dry-run
   #+end_src

* Deploying Certificates

1. Generate (unencrypted) private key file

   *Important*: Make sure only authorized server administrators have
   access to the private key.
   
   #+begin_src bash :dir /ssh:mushr-mycodo2|sudo:root@mushr-mycodo2:/home/test/ :results output :session
     openssl rsa -in /etc/letsencrypt/live/<domain-name>/privkey.pem -out /home/<username>/Mycodo/mycodo/mycodo_flask/ssl_certs/server.key
   #+end_src

   #+RESULTS:

2. Convert certificate from PEM to CRT

   #+begin_src bash :dir /ssh:mushr-mycodo2|sudo:root@mushr-mycodo2:/home/test/ :results output :session
     openssl x509 -in /etc/letsencrypt/live/<domain-name>/cert.pem -out /home/<username>/Mycodo/mycodo/mycodo_flask/ssl_certs/server.crt
   #+end_src

   #+RESULTS:

3. Restart Mycodo
   #+begin_src bash :dir /ssh:mushr-mycodo2|sudo:root@mushr-mycodo2:/home/test/ :results output :session
     systemctl restart nginx
     systemctl restart mycodo
     systemctl restart mycodoflask
   #+end_src

   #+RESULTS:

* TODO Auto-renewal scripts
* Extra Hardening
